{"backend": "tensorflow", "class_name": "Sequential", "keras_version": "2.2.4", "config": {"name": "sequential_1", "layers": [{"class_name": "Reshape", "config": {"batch_input_shape": [null, 504], "name": "reshape_1", "trainable": true, "dtype": "float32", "target_shape": [504, 1]}}, {"class_name": "Conv1D", "config": {"kernel_size": [5], "kernel_constraint": null, "trainable": true, "batch_input_shape": [null, 504], "bias_constraint": null, "activity_regularizer": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1], "name": "conv1d_1", "filters": 50, "strides": [1], "kernel_regularizer": null, "padding": "valid", "activation": "elu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "bias_regularizer": null, "data_format": "channels_last", "dtype": "float32"}}, {"class_name": "Conv1D", "config": {"kernel_size": [10], "kernel_constraint": null, "trainable": true, "bias_constraint": null, "activity_regularizer": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1], "name": "conv1d_2", "filters": 50, "strides": [1], "kernel_regularizer": null, "padding": "valid", "activation": "elu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "bias_regularizer": null, "data_format": "channels_last"}}, {"class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_1", "strides": [10], "trainable": true, "padding": "valid", "pool_size": [10], "data_format": "channels_last"}}, {"class_name": "Conv1D", "config": {"kernel_size": [10], "kernel_constraint": null, "trainable": true, "bias_constraint": null, "activity_regularizer": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1], "name": "conv1d_3", "filters": 80, "strides": [1], "kernel_regularizer": null, "padding": "valid", "activation": "elu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "bias_regularizer": null, "data_format": "channels_last"}}, {"class_name": "GlobalAveragePooling1D", "config": {"name": "global_average_pooling1d_1", "trainable": true, "data_format": "channels_last"}}, {"class_name": "Dense", "config": {"bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "bias_constraint": null, "use_bias": true, "name": "dense_1", "units": 64, "kernel_regularizer": null, "activity_regularizer": null, "activation": "elu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "kernel_constraint": null}}, {"class_name": "Dense", "config": {"bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "bias_constraint": null, "use_bias": true, "name": "dense_2", "units": 32, "kernel_regularizer": null, "activity_regularizer": null, "activation": "elu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "kernel_constraint": null}}, {"class_name": "Dense", "config": {"bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "bias_constraint": null, "use_bias": true, "name": "dense_3", "units": 16, "kernel_regularizer": null, "activity_regularizer": null, "activation": "elu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "kernel_constraint": null}}, {"class_name": "Dense", "config": {"bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "bias_constraint": null, "use_bias": true, "name": "dense_4", "units": 8, "kernel_regularizer": null, "activity_regularizer": null, "activation": "elu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "kernel_constraint": null}}, {"class_name": "Dense", "config": {"bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "bias_constraint": null, "use_bias": true, "name": "dense_5", "units": 4, "kernel_regularizer": null, "activity_regularizer": null, "activation": "elu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "kernel_constraint": null}}]}}