{"backend": "tensorflow", "keras_version": "2.2.4", "class_name": "Sequential", "config": {"layers": [{"class_name": "Reshape", "config": {"dtype": "float32", "trainable": true, "target_shape": [504, 1], "batch_input_shape": [null, 504], "name": "reshape_1"}}, {"class_name": "Conv1D", "config": {"dilation_rate": [1], "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "activation": "elu", "strides": [1], "trainable": true, "kernel_constraint": null, "padding": "valid", "kernel_size": [5], "filters": 50, "activity_regularizer": null, "batch_input_shape": [null, 504], "bias_initializer": {"class_name": "Zeros", "config": {}}, "dtype": "float32", "data_format": "channels_last", "bias_constraint": null, "name": "conv1d_1", "kernel_regularizer": null, "bias_regularizer": null}}, {"class_name": "Conv1D", "config": {"dilation_rate": [1], "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "activation": "elu", "name": "conv1d_2", "strides": [1], "trainable": true, "kernel_constraint": null, "padding": "valid", "kernel_size": [10], "filters": 50, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "bias_constraint": null, "bias_regularizer": null, "kernel_regularizer": null}}, {"class_name": "MaxPooling1D", "config": {"padding": "valid", "trainable": true, "data_format": "channels_last", "strides": [10], "pool_size": [10], "name": "max_pooling1d_1"}}, {"class_name": "Conv1D", "config": {"dilation_rate": [1], "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "activation": "elu", "name": "conv1d_3", "strides": [1], "trainable": true, "kernel_constraint": null, "padding": "valid", "kernel_size": [10], "filters": 80, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "bias_constraint": null, "bias_regularizer": null, "kernel_regularizer": null}}, {"class_name": "GlobalAveragePooling1D", "config": {"data_format": "channels_last", "trainable": true, "name": "global_average_pooling1d_1"}}, {"class_name": "Dense", "config": {"use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "activation": "elu", "trainable": true, "units": 64, "kernel_constraint": null, "name": "dense_1", "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "bias_regularizer": null, "kernel_regularizer": null}}, {"class_name": "Dense", "config": {"use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "activation": "elu", "trainable": true, "units": 32, "kernel_constraint": null, "name": "dense_2", "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "bias_regularizer": null, "kernel_regularizer": null}}, {"class_name": "Dense", "config": {"use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "activation": "elu", "trainable": true, "units": 16, "kernel_constraint": null, "name": "dense_3", "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "bias_regularizer": null, "kernel_regularizer": null}}, {"class_name": "Dense", "config": {"use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "activation": "elu", "trainable": true, "units": 8, "kernel_constraint": null, "name": "dense_4", "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "bias_regularizer": null, "kernel_regularizer": null}}, {"class_name": "Dense", "config": {"use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "activation": "elu", "trainable": true, "units": 4, "kernel_constraint": null, "name": "dense_5", "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "bias_regularizer": null, "kernel_regularizer": null}}], "name": "sequential_1"}}