{"keras_version": "2.2.4", "config": {"layers": [{"config": {"kernel_constraint": null, "bias_regularizer": null, "activation": "elu", "name": "dense_1", "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "batch_input_shape": [null, 502], "activity_regularizer": null, "dtype": "float32", "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "bias_constraint": null, "units": 64, "use_bias": true}, "class_name": "Dense"}, {"config": {"kernel_constraint": null, "bias_regularizer": null, "activation": "elu", "name": "dense_2", "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "bias_constraint": null, "units": 32, "use_bias": true}, "class_name": "Dense"}, {"config": {"kernel_constraint": null, "bias_regularizer": null, "activation": "elu", "name": "dense_3", "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "bias_constraint": null, "units": 16, "use_bias": true}, "class_name": "Dense"}, {"config": {"kernel_constraint": null, "bias_regularizer": null, "activation": "elu", "name": "dense_4", "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "bias_constraint": null, "units": 8, "use_bias": true}, "class_name": "Dense"}, {"config": {"kernel_constraint": null, "bias_regularizer": null, "activation": "elu", "name": "dense_5", "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "bias_constraint": null, "units": 4, "use_bias": true}, "class_name": "Dense"}], "name": "sequential_1"}, "backend": "tensorflow", "class_name": "Sequential"}