{"class_name": "Sequential", "keras_version": "2.2.4", "config": {"layers": [{"class_name": "Dense", "config": {"bias_regularizer": null, "units": 64, "use_bias": true, "name": "dense_1", "kernel_regularizer": null, "batch_input_shape": [null, 98], "kernel_constraint": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "trainable": true, "dtype": "float32", "activation": "elu", "activity_regularizer": null}}, {"class_name": "Dense", "config": {"units": 32, "use_bias": true, "name": "dense_2", "kernel_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "trainable": true, "bias_regularizer": null, "activation": "elu", "activity_regularizer": null}}, {"class_name": "Dense", "config": {"units": 16, "use_bias": true, "name": "dense_3", "kernel_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "trainable": true, "bias_regularizer": null, "activation": "elu", "activity_regularizer": null}}, {"class_name": "Dense", "config": {"units": 8, "use_bias": true, "name": "dense_4", "kernel_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "trainable": true, "bias_regularizer": null, "activation": "elu", "activity_regularizer": null}}, {"class_name": "Dense", "config": {"units": 4, "use_bias": true, "name": "dense_5", "kernel_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "trainable": true, "bias_regularizer": null, "activation": "linear", "activity_regularizer": null}}], "name": "sequential_1"}, "backend": "tensorflow"}