{"keras_version": "2.2.4", "config": {"layers": [{"config": {"target_shape": [506, 1], "batch_input_shape": [null, 506], "name": "reshape_1", "dtype": "float32", "trainable": true}, "class_name": "Reshape"}, {"config": {"bias_regularizer": null, "dilation_rate": [1], "batch_input_shape": [null, 506, 1], "activity_regularizer": null, "strides": [1], "bias_constraint": null, "trainable": true, "kernel_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "name": "conv1d_1", "dtype": "float32", "kernel_constraint": null, "padding": "valid", "activation": "elu", "use_bias": true, "kernel_size": [5], "filters": 50, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_last"}, "class_name": "Conv1D"}, {"config": {"bias_regularizer": null, "name": "conv1d_2", "activity_regularizer": null, "strides": [1], "bias_constraint": null, "padding": "valid", "trainable": true, "kernel_regularizer": null, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1], "activation": "elu", "use_bias": true, "kernel_size": [10], "filters": 50, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "data_format": "channels_last"}, "class_name": "Conv1D"}, {"config": {"pool_size": [10], "strides": [10], "padding": "valid", "data_format": "channels_last", "name": "max_pooling1d_1", "trainable": true}, "class_name": "MaxPooling1D"}, {"config": {"bias_regularizer": null, "name": "conv1d_3", "activity_regularizer": null, "strides": [1], "bias_constraint": null, "padding": "valid", "trainable": true, "kernel_regularizer": null, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1], "activation": "elu", "use_bias": true, "kernel_size": [10], "filters": 80, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "data_format": "channels_last"}, "class_name": "Conv1D"}, {"config": {"trainable": true, "name": "global_average_pooling1d_1", "data_format": "channels_last"}, "class_name": "GlobalAveragePooling1D"}, {"config": {"bias_regularizer": null, "name": "dense_1", "activity_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "units": 64, "kernel_regularizer": null, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "elu", "use_bias": true, "trainable": true}, "class_name": "Dense"}, {"config": {"bias_regularizer": null, "name": "dense_2", "activity_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "units": 32, "kernel_regularizer": null, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "elu", "use_bias": true, "trainable": true}, "class_name": "Dense"}, {"config": {"bias_regularizer": null, "name": "dense_3", "activity_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "units": 16, "kernel_regularizer": null, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "elu", "use_bias": true, "trainable": true}, "class_name": "Dense"}, {"config": {"bias_regularizer": null, "name": "dense_4", "activity_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "units": 8, "kernel_regularizer": null, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "elu", "use_bias": true, "trainable": true}, "class_name": "Dense"}, {"config": {"bias_regularizer": null, "name": "dense_5", "activity_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "units": 4, "kernel_regularizer": null, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "elu", "use_bias": true, "trainable": true}, "class_name": "Dense"}], "name": "sequential_1"}, "backend": "tensorflow", "class_name": "Sequential"}