{"class_name": "Sequential", "config": {"layers": [{"class_name": "Reshape", "config": {"trainable": true, "target_shape": [504, 2], "batch_input_shape": [null, 1008], "dtype": "float32", "name": "reshape_1"}}, {"class_name": "Conv1D", "config": {"strides": [1], "filters": 50, "use_bias": true, "activation": "elu", "name": "conv1d_1", "dilation_rate": [1], "trainable": true, "kernel_constraint": null, "dtype": "float32", "kernel_regularizer": null, "padding": "valid", "batch_input_shape": [null, 504, 2], "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "kernel_size": [5], "bias_constraint": null, "activity_regularizer": null, "bias_regularizer": null}}, {"class_name": "Conv1D", "config": {"strides": [1], "filters": 50, "use_bias": true, "activation": "elu", "name": "conv1d_2", "dilation_rate": [1], "trainable": true, "kernel_constraint": null, "kernel_regularizer": null, "kernel_size": [10], "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "padding": "valid", "bias_constraint": null, "activity_regularizer": null, "bias_regularizer": null}}, {"class_name": "MaxPooling1D", "config": {"strides": [10], "name": "max_pooling1d_1", "trainable": true, "data_format": "channels_last", "pool_size": [10], "padding": "valid"}}, {"class_name": "Conv1D", "config": {"strides": [1], "filters": 80, "use_bias": true, "activation": "elu", "name": "conv1d_3", "dilation_rate": [1], "trainable": true, "kernel_constraint": null, "kernel_regularizer": null, "kernel_size": [10], "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "padding": "valid", "bias_constraint": null, "activity_regularizer": null, "bias_regularizer": null}}, {"class_name": "GlobalAveragePooling1D", "config": {"data_format": "channels_last", "name": "global_average_pooling1d_1", "trainable": true}}, {"class_name": "Dense", "config": {"use_bias": true, "name": "dense_1", "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "kernel_regularizer": null, "kernel_constraint": null, "activation": "elu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "units": 64, "activity_regularizer": null, "bias_regularizer": null}}, {"class_name": "Dense", "config": {"use_bias": true, "name": "dense_2", "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "kernel_regularizer": null, "kernel_constraint": null, "activation": "elu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "units": 32, "activity_regularizer": null, "bias_regularizer": null}}, {"class_name": "Dense", "config": {"use_bias": true, "name": "dense_3", "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "kernel_regularizer": null, "kernel_constraint": null, "activation": "elu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "units": 16, "activity_regularizer": null, "bias_regularizer": null}}, {"class_name": "Dense", "config": {"use_bias": true, "name": "dense_4", "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "kernel_regularizer": null, "kernel_constraint": null, "activation": "elu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "units": 8, "activity_regularizer": null, "bias_regularizer": null}}, {"class_name": "Dense", "config": {"use_bias": true, "name": "dense_5", "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "kernel_regularizer": null, "kernel_constraint": null, "activation": "elu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "units": 4, "activity_regularizer": null, "bias_regularizer": null}}], "name": "sequential_1"}, "keras_version": "2.2.4", "backend": "tensorflow"}