{"config": {"layers": [{"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "activation": "elu", "activity_regularizer": null, "kernel_regularizer": null, "batch_input_shape": [null, 1003], "use_bias": true, "bias_regularizer": null, "name": "dense_1", "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "units": 64, "trainable": true, "dtype": "float32", "bias_constraint": null}, "class_name": "Dense"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "activation": "elu", "activity_regularizer": null, "kernel_regularizer": null, "use_bias": true, "bias_regularizer": null, "name": "dense_2", "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "units": 64, "trainable": true, "bias_constraint": null}, "class_name": "Dense"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "activation": "elu", "activity_regularizer": null, "kernel_regularizer": null, "use_bias": true, "bias_regularizer": null, "name": "dense_3", "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "units": 32, "trainable": true, "bias_constraint": null}, "class_name": "Dense"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "activation": "elu", "activity_regularizer": null, "kernel_regularizer": null, "use_bias": true, "bias_regularizer": null, "name": "dense_4", "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "units": 16, "trainable": true, "bias_constraint": null}, "class_name": "Dense"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "activation": "elu", "activity_regularizer": null, "kernel_regularizer": null, "use_bias": true, "bias_regularizer": null, "name": "dense_5", "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "units": 8, "trainable": true, "bias_constraint": null}, "class_name": "Dense"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "activation": "elu", "activity_regularizer": null, "kernel_regularizer": null, "use_bias": true, "bias_regularizer": null, "name": "dense_6", "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "units": 4, "trainable": true, "bias_constraint": null}, "class_name": "Dense"}], "name": "sequential_1"}, "class_name": "Sequential", "backend": "tensorflow", "keras_version": "2.2.4"}